## 主線任務

蠻有故事性的


## 蛻變

這遊戲有換皮，讓你帥帥，客製化的程度蠻高的，尤其是頭部


## 競技場

打其他玩家，結算時會有寶石、裝備...etc，出場會另外搭配兩隻小兵，小兵也可以升級，小兵需要用在普通任務時用拳套去捕獲(打倒即捕獲)


## 商人

素材、裝備、藥水、寶箱都買的到、也可以交換升級素材，這遊戲有5大區域，加一加商人大概20間，另外競技場，怪物洞穴，公會都有商店


## 武器/裝甲 

寶箱可以開出

一般(灰)
稀有(綠)
史詩(藍)
傳奇(紫)
獨特(黃)

下面這個要40級之後，獻祭上面的物品可以得到，獻祭所需的物品，灰的大概10來個 ... 獨特一個
神秘(水藍)


武器/裝甲在1~10, 10~20, 20~30, 30~40, 40~60 都需要不同的礦石去升級
如果升到10, 20, .. 40 級了，就到了上限，需要不同顏色的礦物加上符文的東西才能進到下一階段

每個武器都剋一種怪物，怪物類型有8種，神秘等級武器可以剋兩種怪物，神秘等級裝甲也可以剋怪物，其他裝甲不能剋怪物，剋怪物可以兩倍傷害


## 英雄

英雄同樣可以從寶箱開出

一般(灰) 最高星等3
稀有(綠) 最高星等4
史詩(藍) 最高星等5
傳奇(紫) 最高星等6
獨特(黃) 最高星等7

地圖可以農到一般(灰)、稀有(綠)、史詩(藍)的英雄碎片，傳奇與獨特要靠寶箱，後期基本上要靠傳奇/獨特英雄

每個英雄有星等可以升，像綠色很容易就升到4星滿，因為可以農，增加星等都可以增加英雄強度，假設我的某隻綠色英雄升滿4星了，如果我又抽到了同樣的英雄碎片，就會轉換為史詩(藍)的粉末，史詩(藍)粉末湊到100可以去商人那裏開寶箱，可以開史詩(藍)的英雄碎片。同樣也有機會拿到獨特(黃)粉末，如果剛好開出到已經滿星的紫色英雄，所以慢慢農最後一定可以拿到黃色英雄

英雄有分屬性 
神聖 英勇 勇士 邏輯 反叛 獨行俠 黑暗 混亂 法治 狂亂

英雄也有分職業
術士 盜賊 煉金師 獵人 戰士 

一次開五個英雄寶箱有保底一個史詩(藍)，目前我最多開到傳奇(紫)


## 英雄祭壇

主要可以派英雄去出任務賺經驗值升級，我目前解鎖了三個祭壇，每個祭壇可以出三個任務，時間長的任務有時候會限制星等或稀有度，類似需要4星戰士，或是傳奇獵人才能出任務之類的


## 鎔爐

可以合成物品 
2灰 -> 1綠
3綠 -> 1藍
4藍 -> 1紫
5紫 -> 1黃

也可以合成符文，規則同上


## 怪物洞穴

可以打怪去怪物商店買東西，獲得的怪物精華可以買裝備的升級素材、防具、武器、藥水、寶箱，我都買英雄寶箱居多，接下來會有兩倍怪物精華的活動


## 漫遊怪物

可以從中選一個懸賞接，打倒懸賞的怪物可以從獎勵品三選一
地圖會隨機出現怪物，可以獲得藥水、拳套核心、火把、金幣、寶石、經驗值卷軸...etc，獎勵越好怪越強


## 拳套

有各式拳套，解鎖拳套有不同條件，目前我大概解鎖了四個，不同的拳套可以提升不同類型的英雄，提升不同類型武器的傷害。不同拳套可以搭配不同英雄，做不同的流派搭配，戰士流、法師流、盜賊流 ... etc 
不同的拳套可以捕獲不同的小兵，小兵也有等級跟類型: 一般~... ~獨特(黃)，目前我最多抓到綠色的小兵


拳套要升級要靠拳套核心，拳套核心同樣也有分綠、藍、紫、黃

## 免費寶箱

免費寶箱也可以開出綠色英雄的碎片，還有其他有的沒的


## 地窖/黑暗地窖

也是打怪拿寶箱，目前我40級只打到第四層，普通有10層。黑暗地窖是普通地窖的進階版，等級未到，還沒開起


## 公會
可以打工會召喚的怪物，目前我用公會幣已經解鎖紫色英雄，已經升到2星


## 公會戰
昨天剛推出的新功能，佔點，可以派人防守，也可以去打別人的點，每天會結算，可以獲得獎勵....etc，最後結算好像也有獎品，目前還算公平，四個工會搶點，實力算接近，我們工會活人好像不多，人都還沒滿，休閒性質，主要靠我們副會長等級60(裝都神秘等級lv60，英雄也都60)


## rift 秘境

我40級剛開，看起來跟神秘物品有關，還不知道是幹嘛的


## 高塔 ... end game 玩家打的，我還差得遠不知道在幹嘛，哈哈

## 課金
目前我就買活動通行證 $170 兩個月時間

# 每日任務
一堆獎勵，全做完給40寶石，不難

# 每周任務
一堆獎勵，全做完給一個大寶箱，不難

# 支線任務






